## 1. Analysis of costs to run animal shelters
<p>You are working as a data analyst in the animal welfare department. In preparation for next year's budget, the head of your department would like to know the total cost to shelter animals, broken down by each animal type and size combination (i.e., 'small dogs', 'large dogs', etc.). You need to prepare a table that contains this information.</p>
<p>The total cost to shelter an animal for the year is calculated as the sum of three factors: the size and animal type, the age, and the location.</p>
<ul>
<li>The base cost of sheltering an animal is based upon its size and type. The costs per animal type and size are contained in the <code>size_costs</code> table. The criteria for classifying size has recently been updated, and so you will need to categorize animals based upon the following table:</li>
</ul>
<table>
<thead>
<tr>
<th style="text-align:right;"></th>
<th style="text-align:right;">Small</th>
<th>Medium</th>
<th>Large</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:right;">Dog</td>
<td style="text-align:right;">&lt;= 10 lbs</td>
<td>10 lbs &lt; and &lt;= 30 lbs</td>
<td>30 lbs &lt;</td>
</tr>
<tr>
<td style="text-align:right;">Cat</td>
<td style="text-align:right;">&lt;= 5 lbs</td>
<td>5 lbs &lt; and &lt;= 7 lbs</td>
<td>7 lbs &lt;</td>
</tr>
<tr>
<td style="text-align:right;">Bird</td>
<td style="text-align:right;">&lt;= 0.7 lbs</td>
<td>0.7 lbs &lt; and &lt;= 1.1 lbs</td>
<td>1.1 lbs &lt;</td>
</tr>
</tbody>
</table>
<ul>
<li>Older animals cost more, and so an age cost (contained in the <code>age_costs</code> table) is added. Each animal's age should be calculated as the age by the end of the year (December 31st, 2021).</li>
<li>There is a location cost depending on where the animal is sheltered (contained in the <code>location_costs</code> table). </li>
<li>The calculation should not include animals that have been sponsored by private charities (sponsored animals are listed in the <code>sponsored_animals</code> table).</li>
</ul>
<p>For future visualization purposes, you will also need to include a <code>percentage</code> column in your result. This percentage should reflect the fraction of the total cost to be allocated to each animal and size combination.</p>
<p>The data you need is available in the tables shown in the database schema below.</p>
<h5 id="databaseschema">Database Schema</h5>
<p><img src="https://assets.datacamp.com/production/repositories/5934/datasets/a946a159c0024ee0995f7a030f2c0cf802203835/diagram.PNG" width="500" height="500"> </p>

In [2]:
import pandas as pd

In [7]:
a =pd.read_csv('./datasets/animal_data.csv')
a.shape

(11899, 6)

In [7]:
from sqlalchemy import create_engine

In [9]:
%% sql
%sql postgresql://postgres:admin@localhost/animal_shelters
        
select * from size_costs LIMIT 5

UsageError: Cell magic `%%` not found.

In [27]:
%%sql
postgresql:///animal_shelters
    select * from age_costs LIMIT 10

10 rows affected.

[(0, 0),
 (1, 0),
 (2, 0),
 (3, 0),
 (4, 0),
 (5, 100),
 (6, 100),
 (7, 100),
 (8, 150),
 (9, 150)]

In [28]:
%%sql
postgresql:///animal_shelters
SELECT column_name, data_type
FROM information_schema.columns
where column_name in ('age','costs')
AND table_name = 'age_costs'

2 rows affected.

[('age', 'integer'), ('costs', 'integer')]

In [29]:
%%sql
postgresql:///animal_shelters
ALTER TABLE age_costs ALTER COLUMN age TYPE integer USING (trim(age)::integer);

(psycopg2.errors.UndefinedFunction) function pg_catalog.btrim(integer) does not exist
HINT:  No function matches the given name and argument types. You might need to add explicit type casts.

[SQL: ALTER TABLE age_costs ALTER COLUMN age TYPE integer USING (trim(age)::integer);]
(Background on this error at: http://sqlalche.me/e/14/f405)

In [30]:
%%sql
postgresql:///animal_shelters
    select * from location_costs LIMIT 10

5 rows affected.

[('San Antonio', 120),
 ('Dallas', 110),
 ('Houston', 140),
 ('Austin', 135),
 ('Fort Worth', 100)]

In [31]:
%%sql
postgresql:///animal_shelters
    select * from sponsored_animals LIMIT 10

10 rows affected.

[('7e18c2a067e4fd', 'Cat', 'Houston'),
 ('32372ddbe6e3ec', 'Cat', 'Austin'),
 ('3b5b82a5555895', 'Dog', 'Austin'),
 ('da29bb3c402c1c', 'Dog', 'Austin'),
 ('15bf11c3efa431', 'Cat', 'Austin'),
 ('36806649e5722d', 'Cat', 'Houston'),
 ('d7062f851d9101', 'Cat', 'Houston'),
 ('d231eaa79ced6f', 'Dog', 'Fort Worth'),
 ('18596d0453f828', 'Dog', 'Austin'),
 ('b3b7ec96b85208', 'Dog', 'Fort Worth')]

In [32]:
%%sql
postgresql:///animal_shelters
    select * from animals LIMIT 10

10 rows affected.

[('80066a4b41ac06', '05/11/2019', 'Cat', 'Blue Tabby/White', 4.0, 'Fort Worth'),
 ('968bf2e7230d2f', '11/12/2012', 'Cat', 'Torbie', 7.0, 'Houston'),
 ('8aacfe19c56b0f', '07/08/2013', 'Dog', 'White/Tan', 45.0, 'Austin'),
 ('7126d96889803f', '04/05/2015', 'Cat', 'Black', 3.0, 'Houston'),
 ('9617240ad5b268', '04/29/2014', 'Cat', 'Black', 9.0, 'Houston'),
 ('fd7bf1fa986957', '10/11/2017', 'Dog', 'Tan/White', 39.0, 'Austin'),
 ('691081c83b1075', '07/11/2016', 'Dog', 'White/Tan', 3.0, 'Fort Worth'),
 ('f957d0fabf9e63', '02/10/2018', 'Dog', 'Black/Brown', 24.0, 'Fort Worth'),
 ('43dfa7ef83d83b', '10/26/2018', 'Dog', 'Brown', 36.0, 'San Antonio'),
 ('2f17d474be934d', '05/03/2017', 'Dog', 'White/White', 16.0, 'Austin')]

START HERE

In [40]:
%%sql
postgresql:///animal_shelters
SELECT column_name, data_type
FROM information_schema.columns
where column_name in ('birthdate','animaltype','weight')
AND table_name = 'animals'

3 rows affected.

[('birthdate', 'character varying'),
 ('animaltype', 'character varying'),
 ('weight', 'real')]

In [42]:
%%sql
postgresql:///animal_shelters
    
WITH all_animals as (
    SELECT animalid,
           (DATE_PART('year',TO_DATE('12/31/2021','MM-DD-YYYY')) - (DATE_PART('year',TO_DATE(birthdate,'MM-DD-YYYY'))))::integer as age,
           animaltype,
           CASE 
                WHEN animaltype = 'Dog' AND weight <=10 THEN 'Small'
                WHEN animaltype = 'Dog' AND weight > 30 THEN 'Large'
                WHEN animaltype = 'Dog' AND weight > 10 AND weight <= 30 THEN 'Medium'
                WHEN animaltype = 'Cat' AND weight <=5 THEN 'Small'
                WHEN animaltype = 'Cat' AND weight > 7 THEN 'Large'
                WHEN animaltype = 'Cat' AND weight > 5 AND weight <=7 THEN 'Medium' 
                WHEN animaltype = 'Bird' AND weight <=0.7 THEN 'Small'
                WHEN animaltype = 'Bird' AND weight > 1.1 THEN 'Large'
                ELSE 'Medium'
           END size, 
           location
    FROM animals
 ), animal_costs as (
    SELECT  animalid,
            aa.animaltype,
            aa.size,
            ac.costs + sc.costs + lc.costs as total
    FROM all_animals as aa
    LEFT JOIN location_costs as lc
    ON aa.location = lc.location
    LEFT JOIN age_costs as ac
    ON aa.age = ac.age
    LEFT JOIN size_costs as sc
    ON aa.animaltype = sc.animaltype 
    AND aa.size = sc.size
), group_animals as(
SELECT  anc.animaltype,
        anc.size,
        SUM(total) as total
from animal_costs as anc
LEFT JOIN sponsored_animals
ON anc.animalid = sponsored_animals.sponsorid
WHERE sponsored_animals.sponsorid IS NULL
GROUP BY anc.animaltype, anc.size
ORDER BY anc.animaltype, anc.size DESC
)

SELECT  *,
        ROUND((total / SUM(total) OVER())*100 ::numeric,2) as percentage
FROM group_animals

9 rows affected.

[('Bird', 'Small', 1615, Decimal('0.05')),
 ('Bird', 'Medium', 3130, Decimal('0.09')),
 ('Bird', 'Large', 8120, Decimal('0.23')),
 ('Cat', 'Small', 518015, Decimal('14.90')),
 ('Cat', 'Medium', 250575, Decimal('7.21')),
 ('Cat', 'Large', 439490, Decimal('12.64')),
 ('Dog', 'Small', 336530, Decimal('9.68')),
 ('Dog', 'Medium', 941895, Decimal('27.09')),
 ('Dog', 'Large', 977665, Decimal('28.12'))]